Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewRbeMode Property

---

"Show Room Bounding Elements Dimmed and Underlay"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewRbeMode { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewRbeMode As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewRbeMode {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewRbeMode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace